{
  "id": "e70c4115-c47c-424f-bb0e-f752f1745473",
  "problem": "**Prompt: Requirements for Puppeteer Browser Automation MCP Server**\n\n** Path for storing the MCP Server: D:\\Dropbox\\1\\Matthew's Team Dropbox\\‎ ‎ ‎ Harrison\\My Files #1\\Zanny's Free to Use Puppeteer MCP Server\\1\n\n**1. Overall Goal:**\nCreate an MCP server named `puppeteer-browser` that enables Roo Cline & Cline to perform browser automation tasks using Puppeteer. The server should control *non-headless* Chrome browser instances, allowing the user to observe the automation in real-time. The server must aim for **guaranteed operation across all target websites**, employing advanced techniques to handle variations and anti-automation measures.\nBe sure to use the AI model that is current set on Roo Code, and before each step is performed, anaylze the image using the model from Roo Code's configuration, then use that to find issues with the browser or page, or if there is a captcha, a block, a rate limit, any issue can be found and can be resolved accordingly.\n\n**2. Core Functionality (Puppeteer Actions):**\nThe server must provide tools corresponding to common Puppeteer actions, including but not limited to:\n*   `goto(url)`: Navigate to a specified URL.\n*   `click(selector)`: Click on an element matching the CSS selector.\n*   `type(selector, text, [options])`: Type text into an input field. Options could include `{ delay: number }`.\n*   `select(selector, value)`: Select an option within a `<select>` element.\n*   `waitForSelector(selector, [options])`: Wait for an element to appear in the DOM. Options could include `{ visible: boolean, timeout: number }`.\n*   `evaluate(js_function, ...args)`: Execute a JavaScript function within the page context.\n*   `extractText(selector)`: Extract the text content of element(s) matching the selector.\n*   `extractAttribute(selector, attributeName)`: Extract an attribute value from an element.\n*   `screenshot([options])`: Take a screenshot of the current page. Options could include `{ path: string, fullPage: boolean }`.\n*   `scroll(x, y)`: Scroll the page by specified amounts.\n*   `hover(selector)`: Hover the mouse cursor over an element.\n\nThe server should be designed with extensibility in mind, allowing new Puppeteer actions to be added as tools in the future.\n\n**3. Concurrency and State Management:**\n*   **Multiple Sessions:** The server must support managing **multiple concurrent browser sessions** independently. Users should be able to initiate, interact with, and terminate specific sessions.\n*   **Complex State Management:** Implement robust mechanisms for **managing complex state across different user requests within a session**. This includes handling logins, cookies, local storage, and session variables to maintain context for multi-step operations.\n\n**4. Invocation / Triggering:**\nUsers should be able to invoke the browser actions through:\n*   **Direct Commands:** Using a clear prefix, e.g., `browser(session_id): goto google.com`, `browser: click #submitButton`. Session ID optional if only one session is active or a default is assumed.\n*   **Advanced Natural Language Intent:** The server must employ **advanced AI-driven interpretation** to understand natural language requests, including **highly ambiguous or complex multi-step tasks**. It should be able to infer user intent, break down complex goals, and sequence appropriate browser actions automatically.\n\n*Examples:*\n    *   `browser(session_A): goto https://google.com`\n    *   `browser: type input[name=q] \"Elon Musk\"`\n    *   `browser: click input[name=btnK]`\n    *   `browser: waitForSelector #search`\n    *   `browser: extractText .g .LC20lb`\n    *   \"Using the browser, log into my bank account, navigate to the statements page, download the last 3 PDF statements, and let me know when done.\" (Requires advanced interpretation, state, and session management).\n\n**5. Configurable Parameters:**\nProvide the following configurable parameters for controlling browser behavior, with sensible defaults:\n*   `default_delay_ms`: Default delay (in milliseconds) between actions (e.g., 100ms). Allow override per action.\n*   `navigation_timeout_ms`: Maximum time (in milliseconds) for navigation actions like `goto` (e.g., 30000ms).\n*   `user_agent_string`: Allow setting a custom User-Agent string. Default to a standard Chrome UA.\n*   `viewport_width`, `viewport_height`: Set the browser window size (e.g., 1280x720).\n*   `screenshot_on_error` (boolean): Automatically take a screenshot if an action fails (default: true).\n*   `data_extraction_format`: Specify format for multi-item data extraction (e.g., \"json\", \"csv\", \"text_list\"). Default: \"json\".\n\nUsers should be able to override these defaults for specific tasks or action sequences if needed.\n\n**6. Error Handling & Resilience:**\n*   Implement advanced error handling, including configurable retries, timeouts, and **strategies to overcome anti-bot measures and CAPTCHAs** where feasible.\n*   Log actions, errors, decisions, and key events extensively for debugging and analysis.\n*   **Advanced Resilience & Self-Correction:** Implement sophisticated resilience mechanisms:\n    *   *Intelligent Retries*: Retry failed actions with modified strategies (e.g., different timings, interaction methods).\n    *   *Dynamic Selector Adaptation*: Actively adapt selectors when elements change structure or attributes.\n    *   *AI-driven Problem Solving*: If an instruction is ambiguous or an action fails persistently, the AI should attempt to diagnose the problem and formulate alternative approaches to achieve the user's inferred goal, potentially asking for clarification only as a last resort. The goal is maximum autonomy and success rate.\n\n**7. Data Handling:**\n*   For tools that extract data, define how single and multiple results are returned. Use the `data_extraction_format` parameter for multiple results.\n*   Return data clearly structured, likely as JSON output from the MCP tool.",
  "thinking_type": "systems",
  "context": "Create MCP server 'puppeteer-browser' in directory D:\\Dropbox\\1\\Matthew's Team Dropbox\\‎ ‎ ‎ Harrison\\My Files #1\\Zanny's Free to Use Puppeteer MCP Server\\1. The server needs to integrate with an AI model (like Roo Code's current one) for image analysis before each browser step and for advanced natural language understanding.",
  "created_at": "2025-03-28T16:27:37.626Z",
  "updated_at": "2025-03-28T16:27:37.626Z",
  "steps": [],
  "metadata": {
    "status": "in_progress",
    "validation_state": "not_validated",
    "completion_percentage": 0,
    "tags": [
      "mcp-server",
      "puppeteer",
      "browser-automation",
      "planning",
      "ai-integration",
      "resilience"
    ]
  },
  "structure": {
    "phase": "initial",
    "expected_steps": 7,
    "pattern": "map_analyze_model"
  }
}